public class helper { // Класс это описание "Кота" в целом
    // Все переменны внутри методов - локальные переменные

    // Свойства чего либо это переменные = Поля
    // String name; - поле имя
    // String color; - поле цвет
    // int age; - поле возраст

    // Медоды класса - глаголы. Ими описывается что данный класс может делать

    // Это конструктор. Конструкторы нужны для заполненя полей класса. Вызывается
    // автоматически при инициализации класса - new... .
    public helper() {

    }
}
